Revit 2017 API
StructuralSectionUtils.GetStructuralSection Method
 Return structural section from element.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public static StructuralSection GetStructuralSection(
	Document document,
	ElementId familySymbolId
)
Visual Basic
Public Shared Function GetStructuralSection ( _
	document As Document, _
	familySymbolId As ElementId _
) As StructuralSection
Visual C++
public:
static StructuralSection^ GetStructuralSection(
	Document^ document,
	ElementId^ familySymbolId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document that owns the family for beam, brace or structural column.
familySymbolId
Type: Autodesk.Revit.DB.ElementId
 ID of family symbol for beam, brace or structural column.
Return Value
 Structural section returned if element have one. For elements that do not have structural section or can not have structural section null will be returned.
Remarks
 Only beams, braces and structural columns can have structural section associated with it.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
StructuralSectionUtils Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace